In [1]:
import duckdb 
import pandas as pd

In [2]:
%load_ext sql

In [3]:
conn = duckdb.connect()

In [4]:
%sql conn --alias duckdb

In [5]:
data = {
    'roll_no': [101, 102, 103, 104, 105],
    'first_name': ['John', 'Emma', 'Michael', 'Sophia', 'Ethan'],
    'last_name': ['Doe', 'Smith', 'Johnson', 'Brown', 'Williams'],
    'grade': ['A', 'B', 'C', 'A', 'B']
}

students =pd.DataFrame(data)
students

   roll_no first_name last_name grade
0      101       John       Doe     A
1      102       Emma     Smith     B
2      103    Michael   Johnson     C
3      104     Sophia     Brown     A
4      105      Ethan  Williams     B

In [7]:
data = {
    'first_name': ['John', 'Peter', 'Ethan'],
}

names = pd.DataFrame(data)
names

  first_name
0       John
1      Peter
2      Ethan

In [9]:
query = """ 
select * 
from students 
where first_name NOT IN (
select first_name 
from names
);
"""

duckdb.sql(query).df().head(6)

   roll_no first_name last_name grade
0      102       Emma     Smith     B
1      103    Michael   Johnson     C
2      104     Sophia     Brown     A

In [10]:
data = {
    'first_name': ['None', 'John', 'Peter', 'Ethan'],
}
names = pd.DataFrame(data)
names

  first_name
0       None
1       John
2      Peter
3      Ethan

In [11]:
query = """ 
select * 
from students 
where first_name NOT IN (select first_name from names);
"""

duckdb.sql(query).df().head(6)

   roll_no first_name last_name grade
0      102       Emma     Smith     B
1      103    Michael   Johnson     C
2      104     Sophia     Brown     A

In [12]:
query = """ 
select * 
from students 
where first_name IN (select first_name from names); 
"""

duckdb.sql(query).df().head(6)

   roll_no first_name last_name grade
0      101       John       Doe     A
1      105      Ethan  Williams     B

In [14]:
query = """  
select * 
from students 
where first_name NOT IN (
select first_name 
from names 
where first_name is NOT NULL
);
"""

duckdb.sql(query).df().head(6)

   roll_no first_name last_name grade
0      102       Emma     Smith     B
1      103    Michael   Johnson     C
2      104     Sophia     Brown     A

In [15]:
query = """
select * 
from students s 
ANTI JOIN names n 
ON (s.first_name = n.first_name);
"""

duckdb.sql(query).df().head(6)

   roll_no first_name last_name grade
0      102       Emma     Smith     B
1      103    Michael   Johnson     C
2      104     Sophia     Brown     A